app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
  	  @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "リーダブルコー"], ["updated_at", "2020-04-26 04:25:39.001512"], ["id", 1]]
---
  def update
      @book = Book.find(params[:id])

   if @book.update(book_params)

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "え"], ["body", "え"], ["created_at", "2020-04-26 03:45:15.187191"], ["updated_at", "2020-04-26 03:45:15.187191"]]
SELECT "books".* FROM "books"
---
  def create
      @book = Book.new(book_params)

   if
      @book.save
      flash[:complete] = "Book was successfully updated."
      redirect_to book_path(@book.id)

  else
      @books = Book.all